/* 1.Лабораторная работа №3. Перегрузка операций

Создайте класс Строка с обязательными член–данными:
длина строки, указатель на строку (строка хранится в
динамически выделенной памяти). Обязательные методы:
конструктор по заданной длине строки, конструктор по заданной строке,
конструктор по другому объекту класса Строка, конструктор копирования,
очистка строки, вывод строки.

Перегрузить (переопределить) операции:
+ (конкатенация ),
-(разность: удаление символов входящих в строку второго операнда),
< (меньше), > (больше).
*/

#include "String.h"

int main() {
    String s1("hello");
    String s2("girl");

    String s3 = s1 + s2;
    s3.print();

    String s4 = s1 - s2;
    s4.print();

    cout << (s1 < s2) << endl;
    cout << (s1 > s2) << endl;

    return 0;
}